# LEET CODE
## Problem-2886: Change Data Type
Class: Easy

Source: https://leetcode.com/problems/change_data_type/

## Description
DataFrame students
| Column Name | Type   |
|-------------|--------|
| student_id  | int    |
| name        | object |
| age         | int    |
| grade       | float  |

## To Do
Write a solution to correct the errors:

The grade column is stored as floats, convert it to integers.

The result format is in the following example.

## Example

Input:

DataFrame students:
| student_id | name | age | grade |
|------------|------|-----|-------|
| 1          | Ava  | 6   | 73.0  |
| 2          | Kate | 15  | 87.0  |

Output:
| student_id | name | age | grade |
|------------|------|-----|-------|
| 1          | Ava  | 6   | 73    |
| 2          | Kate | 15  | 87    |

Explanation: 
- The data types of the column grade is converted to int.

## Importing

In [1]:
import pandas as pd
from typing import List

## Task

In [2]:
def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    return students.assign(grade= students.grade.astype('int'))

In [3]:
data = {
    'id': [1, 2, 3, 4, 5],
    'first': ['Mason', 'Ava', 'Taylor', 'Georgia', 'Thomas'],
    'last': ['King', 'Wright', 'Hall', 'Thompson', 'Moore'],
    'grade': [6.0, 7.0, 16.0, 18.0, 10.0]
}
df = pd.DataFrame(data)

changeDatatype(df)

   id    first      last  grade
0   1    Mason      King      6
1   2      Ava    Wright      7
2   3   Taylor      Hall     16
3   4  Georgia  Thompson     18
4   5   Thomas     Moore     10